blogs/lease-queue-implement-by-mysql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>“租约”消队列</title>
<!-- 2016-01-19 二 17:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zzyongx" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">“租约”消队列</h1>
<p>
通常而言，一个<a href="https://en.wikipedia.org/wiki/Queue_(abstract_data_type)">队列</a> 提供了 <i>enqueue</i> <i>dequeue</i> <i>front</i> 操作，从数据结构的角度看，这就够了，但是从队列服务的角度看，并不满足需求。
</p>

<p>
假设消费者使用 <i>dequeue</i> 取出消息后崩溃了，消息已经不在队列中，并且没有得到处理，无从恢复这条消息，相当于消息丢失了。
</p>

<p>
又假设消费者使用 <i>front</i> 查看消息，处理完后 <i>dequeue</i> 删除消息，这时就不怕消费者崩溃了，即时崩溃也不会丢失消息。这种方式的缺点是，如果有多于一个的消费者， <i>front</i> 会返回相同的消息，这要求消息的处理是 <code>幂等</code> 的，这带来额外的复杂性。
</p>

<p>
其实我们需要的是消息 <b>租约</b> ，从队列取消息只是获得一定时间的使用权，在此期间消息对其它消费者不可见，如果不手动删除消息，租约到期后，消息自动对其它消费者可见。这样可以防止消费者崩溃，又可以同时有多个消费者。  <b>这并不适合队列中的消息需要被严格有序处理的情况，这种队列只能有一个消费者</b>
</p>

<p>
可以使用MySQL模拟这样的服务
</p>
<div class="org-src-container">

<pre class="src src-sql">;; &#34920;&#23450;&#20041;
<span style="color: #00ffff; font-weight: bold;">CREATE</span> <span style="color: #00ffff; font-weight: bold;">TABLE</span> IF <span style="color: #00ffff; font-weight: bold;">NOT</span> <span style="color: #00ffff; font-weight: bold;">EXISTS</span> <span style="color: #0000ff; font-weight: bold;">leaseQueue</span> (
  id            BIGINT AUTO_INCREMENT <span style="color: #00ffff; font-weight: bold;">PRIMARY</span> <span style="color: #00ffff; font-weight: bold;">KEY</span>,
  <span style="color: #00ffff; font-weight: bold;">data</span>          <span style="color: #00ff00;">VARCHAR</span>(128),
  holder        <span style="color: #00ff00;">SMALLINT</span> <span style="color: #00ffff; font-weight: bold;">DEFAULT</span> 0,
  lease         <span style="color: #00ff00;">TIMESTAMP</span>
);

;; &#20837;&#38431;&#21015;
<span style="color: #00ffff; font-weight: bold;">INSERT</span> <span style="color: #00ffff; font-weight: bold;">INTO</span> leaseQueue(<span style="color: #00ffff; font-weight: bold;">data</span>) <span style="color: #00ffff; font-weight: bold;">VALUES</span>(#{<span style="color: #00ffff; font-weight: bold;">data</span>});

;; &#36873;&#20986;&#38431;&#23614;&#28040;&#24687;&#65292;&#24182;&#19988;&#20197;5&#20998;&#38047;&#20026;&#26399;&#31199;&#35813;&#28040;&#24687;&#65292;&#37325;&#22797;&#19979;&#38754;&#20004;&#20010;<span style="color: #00ffff; font-weight: bold;">SQL</span>&#65292;&#30452;&#21040; <span style="color: #00ffff; font-weight: bold;">UPDATE</span> &#24433;&#21709;&#30340;&#34892;&#25968;&#26159;1
<span style="color: #00ffff; font-weight: bold;">SELECT</span> id, <span style="color: #00ffff; font-weight: bold;">data</span> <span style="color: #00ffff; font-weight: bold;">FROM</span> leaseQueue <span style="color: #00ffff; font-weight: bold;">ORDER</span> <span style="color: #00ffff; font-weight: bold;">BY</span> id <span style="color: #00ffff; font-weight: bold;">ASC</span> <span style="color: #00ffff; font-weight: bold;">limit</span> 1;
<span style="color: #00ffff; font-weight: bold;">UPDATE</span> leaseQueue <span style="color: #00ffff; font-weight: bold;">SET</span> holder = holder + 1 <span style="color: #00ffff; font-weight: bold;">WHERE</span> id = #{id} <span style="color: #00ffff; font-weight: bold;">AND</span> TIMESTAMPDIFF(<span style="color: #00ffff; font-weight: bold;">MINUTE</span>, lease, NOW()) &gt;= 5

;; &#22788;&#29702;&#23436;&#21518;&#21024;&#38500;&#28040;&#24687;
<span style="color: #00ffff; font-weight: bold;">DELETE</span> <span style="color: #00ffff; font-weight: bold;">FROM</span> leaseQueue <span style="color: #00ffff; font-weight: bold;">WHERE</span> id = #{id}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zzyongx</p>
<p class="date">Created: 2016-01-19 二 17:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
